# Вычислить число пи с заданной точностью d

import fn

d = float(input('Введите точность d (Пример: 0.0001): '))
print(fn.pi_with_precision(d))